session04/lab04.org
#+TITLE:  Computer Science Fundamentals
#+AUTHOR: Detroit Labs Dev Coaching
#+DATE:   2018
#+EMAIL:  ndotz@detroitlabs.com
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   skip:nil d:nil todo:t pri:nil tags:not-in-toc timestamp:nil
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+REVEAL_PLUGINS: (highlight notes)
#+REVEAL_THEME: league
#+REVEAL_MARGIN: 0.2
# #+REVEAL_MIN_SCALE: 0.5
# #+REVEAL_MAX_SCALE: 2.5
#+REVEAL_EXTRA_CSS: ./presentation.css

* Lab 4
  #+BEGIN_NOTES
  - The Preprocessor
  - macros
  - Working with larger programs
  - Delving into I/O
  #+END_NOTES
* The Preprocessor
** What is the Preprocessor?
  #+BEGIN_NOTES
  p299
  #+END_NOTES
** #define
  #+BEGIN_NOTES
  - Most commonly used to define constants and magic numbers
  - Literal text substitution. Don't use semicolons unless needed.
  p302
  #+END_NOTES
  #+BEGIN_SRC c
  #define YES 1
  #define NO  0
  #define AND &&
  #define OR  ||
  #+END_SRC
  #+BEGIN_SRC c
  #define PHI       1.618033
  #define MAX_LINES 1024
  #+END_SRC
** #include
  #+BEGIN_NOTES
  - Include includes text from other files.
  - This is used to include definitions or declarations from other files.
  - Double-quotes make the preprocessor look in local include paths
  - The angle brackets cause the preprocessor to look for
  p313
  #+END_NOTES
  #+BEGIN_SRC c
  #include "myheader.h"
  #include <stdio.h>
  #+END_SRC
* Macros
  #+BEGIN_NOTES
  - Short for macroinstruction, macros are a rule or pattern to
    specify how some input should be mapped to a replacement output.
  - Utilizing the inline replacement of define, we can create macros
    to reduce the complexity of code that might not be best suited for
    a function or other mechanism.
  p306
  #+END_NOTES
** Macros with Arguments
  #+BEGIN_NOTES
  - Macros can be defined to take arguments. They're placed after the
    macro definition in parentheses.
  - Just like our other definitions, macros are in-lined into our code
    wherever the macro pattern occurs.
  p308
  #+END_NOTES
  #+BEGIN_SRC c
  #define UNDER_100(y) y >= 1 && y < 100
  #define SQUARE(x)    x * x
  #+END_SRC
** Macros with Arguments
  #+BEGIN_NOTES
  - Be careful when defining macros, because the expansion may not
    turn out as you intend.
  - Ample use of parenthesis will help to make sure that expressions
    passed as arguments to macros will be evaluated in the correct order.
  p308
  #+END_NOTES
  #+BEGIN_SRC c
  #define SQUARE(x)    x * x
  #+END_SRC
  #+BEGIN_SRC c
  y = SQUARE(x + 1); /* expands to x + 1 * x + 1 */
  #+END_SRC
  #+BEGIN_SRC c
  #define SQUARE(x)    (x * x)
  #define MAX(a,b)     ( ((a) > (b)) ? (a) : (b) )
  #+END_SRC
** Macros with VARARGS
  #+BEGIN_NOTES
  - There is a special macro substitution form for macros to use
    variable numbers of arguments.
  - Using this format, we can define macros that abstract around
    functions that normally take variable numbers of arguments.
  p311
  #+END_NOTES
  #+BEGIN_SRC c
  #define myprintf(...) printf("MESSAGE: " __VA_ARGS__);
  #+END_SRC
** #ifdef, #endif, #else
  #+BEGIN_NOTES
  - We can use conditionals based on definitions to provide
    conditional preprocessor commands
  - Then, we can make the definition that the ifdef depends on before
    including the file containing the conditional.
  - Modern compilers provide the ability to set definition from the
    command line when compiling. This allows us to turn on or off
    certain definitions controlled by ifdef
  p316
  #+END_NOTES
  #+BEGIN_SRC c
  #ifdef DEBUG
    #define log(...) printf("DEBUG: " __VA_ARGS__);
  #else
    #define log(...) printf(__VA_ARGS__);
  #endif
  #+END_SRC
  #+BEGIN_SRC c
  #define DEBUG
  #+END_SRC
  #+BEGIN_SRC bash
  gcc -D DEBUG myapp.c -o SuperCoolApp
  #+END_SRC
** #ifndef and Multiple Inclusion
  #+BEGIN_NOTES
  - There is a similar preprocessor directive, ifndef, which is the
    inverse of ifdef.
  - This is most commonly used to prevent problems surrounding
    "multiple inclusion" - or redefining definitions because a header
    has been included by multiple files in the project.
  p316
  #+END_NOTES
  #+BEGIN_SRC c
  #ifndef _MYHEADER_H
    #define _MYHEADER_H
    #define MYDEFINITION 1
    int myfunc(int n, char *cs);
  #endif /* _MYHEADER_H */
  #+END_SRC
  #+BEGIN_SRC c
  #include "myheader.h"
  #+END_SRC
** #if, #elif
  #+BEGIN_NOTES
  p316
  #+END_NOTES
  #+BEGIN_SRC c
  #if    DEBUGLEVEL == 1
    #define log(...) printf("MAJOR ERROR: " __VA_ARGS__);
  #elif  DEBUGLEVEL == 2
    #define log(...) printf("MEH THING: " __VA_ARGS__);
  #elif  DEBUGLEVEL == 3
    #define log(...) printf("DEBUG: " __VA_ARGS__);
  #endif
  #+END_SRC
  #+BEGIN_SRC bash
  gcc -D DEBUGLEVEL=2 myapp.c -o SuperCoolApp
  #+END_SRC
* Larger Programs
** Compiling Multiple Modules
  #+BEGIN_NOTES
  - As programs get bigger, it will be important to be able to divide
    them into multiple files to make it easier to organize parts of
    our programs into operable units or modules.
  - We can do this with gcc simply by providing multiple C files to
    the compiler at compile time
  - It's important to know that each of these source files is compiled
    into its own object code file before being combined into the final
    binary
  p334
  #+END_NOTES
  #+BEGIN_SRC c
  gcc constants.c utils.c main.c -o myapp
  #+END_SRC
** extern
  #+BEGIN_NOTES
  - As previously discussed, by default declarations made at top level
    are visible to other modules.
  - However, a module might not necessarily recognize that there is a
    declaration that will be available to it provided by another
    module.
  - This is what the extern keyword does - it tells the compiler to
    assume that a value will be available from another module.
  - This is not a guarantee that the symbol will be provided that when
    combined with other object code to create a binary, though
    compilers will often warn or fail if the symbol is never provided.
  p336
  #+END_NOTES
  #+BEGIN_SRC c
  /* constants.c */
  int MY_GLOBAL_VAR = 1;
  #+END_SRC
  #+BEGIN_SRC c
  /* utils.c */
  extern int MY_GLOBAL_VAR;
  MY_GLOBAL_VAR = 10;
  #+END_SRC
