session04/lab04.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Computer Science Fundamentals</title>
<meta name="author" content="(Detroit Labs Dev Coaching)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/league.css" id="theme"/>

<link rel="stylesheet" href="./presentation.css"/>
<link rel="stylesheet" href="./reveal.js/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Computer Science Fundamentals</h1><h2 class="author">Detroit Labs Dev Coaching</h2><h2 class="date">2018</h2>
</section>

<section>
<section id="slide-org2304d41">
<h2 id="org2304d41">Lab 4</h2>
<aside class="notes">
<ul>
<li>The Preprocessor</li>
<li>macros</li>
<li>Working with larger programs</li>
<li>Delving into I/O</li>

</ul>

</aside>
</section>
</section>
<section>
<section id="slide-orge6e9edc">
<h2 id="orge6e9edc">The Preprocessor</h2>
<div class="outline-text-2" id="text-orge6e9edc">
</div>
</section>
<section id="slide-org727b437">
<h3 id="org727b437">What is the Preprocessor?</h3>
<aside class="notes">
<p>
p299
</p>

</aside>
</section>
<section id="slide-org54d7af0">
<h3 id="org54d7af0">#define</h3>
<aside class="notes">
<ul>
<li>Most commonly used to define constants and magic numbers</li>
<li>Literal text substitution. Don't use semicolons unless needed.</li>

</ul>
<p>
p302
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >#define YES 1
#define NO  0
#define AND &&
#define OR  ||
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >#define PHI       1.618033
#define MAX_LINES 1024
</code></pre>
</div>
</section>
<section id="slide-orgbf28438">
<h3 id="orgbf28438">#include</h3>
<aside class="notes">
<ul>
<li>Include includes text from other files.</li>
<li>This is used to include definitions or declarations from other files.</li>
<li>Double-quotes make the preprocessor look in local include paths</li>
<li>The angle brackets cause the preprocessor to look for</li>

</ul>
<p>
p313
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >#include "myheader.h"
#include <stdio.h>
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org3348393">
<h2 id="org3348393">Macros</h2>
<aside class="notes">
<ul>
<li>Short for macroinstruction, macros are a rule or pattern to
specify how some input should be mapped to a replacement output.</li>
<li>Utilizing the inline replacement of define, we can create macros
to reduce the complexity of code that might not be best suited for
a function or other mechanism.</li>

</ul>
<p>
p306
</p>

</aside>
</section>
<section id="slide-orgb5514c4">
<h3 id="orgb5514c4">Macros with Arguments</h3>
<aside class="notes">
<ul>
<li>Macros can be defined to take arguments. They're placed after the
macro definition in parentheses.</li>
<li>Just like our other definitions, macros are in-lined into our code
wherever the macro pattern occurs.</li>

</ul>
<p>
p308
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >#define UNDER_100(y) y >= 1 && y < 100
#define SQUARE(x)    x * x
</code></pre>
</div>
</section>
<section id="slide-orga50e924">
<h3 id="orga50e924">Macros with Arguments</h3>
<aside class="notes">
<ul>
<li>Be careful when defining macros, because the expansion may not
turn out as you intend.</li>
<li>Ample use of parenthesis will help to make sure that expressions
passed as arguments to macros will be evaluated in the correct order.</li>

</ul>
<p>
p308
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >#define SQUARE(x)    x * x
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >y = SQUARE(x + 1); /* expands to x + 1 * x + 1 */
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >#define SQUARE(x)    (x * x)
#define MAX(a,b)     ( ((a) > (b)) ? (a) : (b) )
</code></pre>
</div>
</section>
<section id="slide-org8a6437d">
<h3 id="org8a6437d">Macros with VARARGS</h3>
<aside class="notes">
<ul>
<li>There is a special macro substitution form for macros to use
variable numbers of arguments.</li>
<li>Using this format, we can define macros that abstract around
functions that normally take variable numbers of arguments.</li>

</ul>
<p>
p311
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >#define myprintf(...) printf("MESSAGE: " __VA_ARGS__);
</code></pre>
</div>
</section>
<section id="slide-org1541072">
<h3 id="org1541072">#ifdef, #endif, #else</h3>
<aside class="notes">
<ul>
<li>We can use conditionals based on definitions to provide
conditional preprocessor commands</li>
<li>Then, we can make the definition that the ifdef depends on before
including the file containing the conditional.</li>
<li>Modern compilers provide the ability to set definition from the
command line when compiling. This allows us to turn on or off
certain definitions controlled by ifdef</li>

</ul>
<p>
p316
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >#ifdef DEBUG
  #define log(...) printf("DEBUG: " __VA_ARGS__);
#else
  #define log(...) printf(__VA_ARGS__);
#endif
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >#define DEBUG
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="bash" >gcc -D DEBUG myapp.c -o SuperCoolApp
</code></pre>
</div>
</section>
<section id="slide-orgccf261c">
<h3 id="orgccf261c">#ifndef and Multiple Inclusion</h3>
<aside class="notes">
<ul>
<li>There is a similar preprocessor directive, ifndef, which is the
inverse of ifdef.</li>
<li>This is most commonly used to prevent problems surrounding
"multiple inclusion" - or redefining definitions because a header
has been included by multiple files in the project.</li>

</ul>
<p>
p316
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >#ifndef _MYHEADER_H
  #define _MYHEADER_H
  #define MYDEFINITION 1
  int myfunc(int n, char *cs);
#endif /* _MYHEADER_H */
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >#include "myheader.h"
</code></pre>
</div>
</section>
<section id="slide-org110dc45">
<h3 id="org110dc45">#if, #elif</h3>
<aside class="notes">
<p>
p316
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >#if    DEBUGLEVEL == 1
  #define log(...) printf("MAJOR ERROR: " __VA_ARGS__);
#elif  DEBUGLEVEL == 2
  #define log(...) printf("MEH THING: " __VA_ARGS__);
#elif  DEBUGLEVEL == 3
  #define log(...) printf("DEBUG: " __VA_ARGS__);
#endif
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="bash" >gcc -D DEBUGLEVEL=2 myapp.c -o SuperCoolApp
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org1fc577b">
<h2 id="org1fc577b">Larger Programs</h2>
<div class="outline-text-2" id="text-org1fc577b">
</div>
</section>
<section id="slide-org7a185f3">
<h3 id="org7a185f3">Compiling Multiple Modules</h3>
<aside class="notes">
<ul>
<li>As programs get bigger, it will be important to be able to divide
them into multiple files to make it easier to organize parts of
our programs into operable units or modules.</li>
<li>We can do this with gcc simply by providing multiple C files to
the compiler at compile time</li>
<li>It's important to know that each of these source files is compiled
into its own object code file before being combined into the final
binary</li>

</ul>
<p>
p334
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >gcc constants.c utils.c main.c -o myapp
</code></pre>
</div>
</section>
<section id="slide-org72ada2b">
<h3 id="org72ada2b">extern</h3>
<aside class="notes">
<ul>
<li>As previously discussed, by default declarations made at top level
are visible to other modules.</li>
<li>However, a module might not necessarily recognize that there is a
declaration that will be available to it provided by another
module.</li>
<li>This is what the extern keyword does - it tells the compiler to
assume that a value will be available from another module.</li>
<li>This is not a guarantee that the symbol will be provided that when
combined with other object code to create a binary, though
compilers will often warn or fail if the symbol is never provided.</li>

</ul>
<p>
p336
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >/* constants.c */
int MY_GLOBAL_VAR = 1;
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >/* utils.c */
extern int MY_GLOBAL_VAR;
MY_GLOBAL_VAR = 10;
</code></pre>
</div>
</section>
