session04/lab04.org
** static
  #+BEGIN_NOTES
  - All top-level declarations are visible to external modules by
    default. While external modules might need to declare values they
    want to use from other modules as external declarations, sometimes
    want to invert this behavior, which is what the static declaration does.
  - Adding static to a declaration makes it so that it is explicitly
    invisible to external modules. A static value or function will
    only be visible from within its own module.
  - Even if another module declares an identifier of the same name to
    be external, a static declaration will never fulfill that extern
    declaration.
  p339
  #+END_NOTES
  #+BEGIN_SRC c
  /* utils.c */
  static char[] secret = "my secret string";
  static short privateKeyGen(int seed) { /* ... */ }
  #+END_SRC
  #+BEGIN_SRC c
  /* main.c */
  extern char[] secret; /* never fulfilled */
  #+END_SRC
** static and extern
  #+BEGIN_SRC c
    /* util.c */
    extern double x;
    double square(void);
        return x * x;
    }
  #+END_SRC
  #+BEGIN_SRC c
    /* main.c */
    double x;
    static double result;
    static void doSquare(void) {
        double square(void);
        x = 2.0;
        result = square();
    }
    int main(void) {
        doSquare();
        printf("%g\n", result);
        return 0;
    }
  #+END_SRC
** Header files
  #+BEGIN_NOTES
  p341
  #+END_NOTES
  #+BEGIN_SRC c
    /* constatnts.h */
    struct item {
        int value;
        struct item *next;
    };
    typedef struct item Item;
    typedef struct item List;
    #define newList(x) = (List) { .value = x }
    #define cons(x, l) = (List) { .value = x, .next = l }
  #+END_SRC
  #+BEGIN_SRC c
    /* main.c */
    #include "constants.h"

    int main(void) {
        List list = newList(4);
        Item i = cons(3, list);
        return 0;
    }
  #+END_SRC
** make
  #+BEGIN_NOTES
  p343
  #+END_NOTES
  #+BEGIN_SRC makefile
  CC=gcc
  CFLAGS=-c -Wall

  all: mycp

  mycp: main.o utils.o fileio.o
      $(CC) main.o utils.o fileio.o -o mycp

  main.o: main.c
      $(CC) $(CFLAGS) main.c

  utils.o: utils.c
      $(CC) $(CFLAGS) utils.c

  fileio.o: fileio.c
      $(CC) $(CFLAGS) fileio.c

  clean:
      rm *o fileio
  #+END_SRC
* I/O
  #+BEGIN_NOTES
  - The C standard library provides a bunch of functionality
    abstracting around I/O.
  - We've already been using printf and scanf for a while, but let's
    take a deeper look at some of the other functionality it provides.
  - This is probably the most-used set of abstractions it provides,
    which makes sense because without input or output, programs don't
    do much.
  #+END_NOTES
  #+BEGIN_SRC
fclose  remove  fprintf  escanf    vsprintf rewind   fgetc   gets
fflush  rename  fscanf   vfprintf  vsscanf  clearerr fgets   putc
fopen   tmpfile printf   vfscanf   fgetpos  feof     fputc   putchar
freopen tmpnam  scanf    vprintf   fseek    ferror   fputs   puts
setbuf  fread   snprintf vscanf    fsetpos  perror   getc
setvbuf fwrite  sprintf  vsnprintf ftell    ungetc   getchar
  #+END_SRC
** printf and scanf
  #+BEGIN_NOTES
  - So, as I mentioned, we've seen quite a bit of printf and scanf
    already, so coming across them this week won't be anything new or
    exciting.
  - However, this week's reading material extensively covers the
    patterns involved in printf and scanf in a way that many of you
    asked about in earlier sessions.
  - How the options and patterns work would be worthy of its own full
    class session worth of discussion, but the book covers this in
    enough detail to be a great reference.
  p348
  #+END_NOTES
  #+BEGIN_SRC c
  printf("20.5%s", "Jessica");  /* "                Jessi" */
  printf("-20.5%s", "Jessica"); /* "Jessi                " */

  scanf("%[^\n]\n", &buffer);
  #+END_SRC
** getchar and putchar
  #+BEGIN_NOTES
  - getchar and putchar are the bread and butter of I/O.
  - They are responsible for getting one character from input and
    sending one character to output, respectively
  p348
  #+END_NOTES
  #+BEGIN_SRC c
  int c = getchar();
  putchar('\n');
  #+END_SRC
** STDIN on Unix
  #+BEGIN_NOTES
  - Now, if you're familiar with Unix, you're probably familiar with
    the ability to change the input stream to a program.
  - Harnessing this ability to change where input comes from gives us
    an easy way to start working with files.
  - Here, we have a program to emulate basic behavior of the Unix cat
    tool
  - Note that the special constant EOF is used to denote an end of
    file marker character
  p359
  #+END_NOTES
  #+BEGIN_SRC c
    /* cat.c */
    #include &lt;stdio.h>

    int main(void) {
        int c;

        while ((c=getchar()) != EOF) {
            putchar(c);
        }
        return 0;
    }
  #+END_SRC
** STDIN on Unix
  #+BEGIN_NOTES
  - Running this program will capture and print each character, as
    expected. It will read from the standard input or stdin, so if we
    run this without piping input to it, it will expect us to enter
    that input directly from the keyboard.
  - However, by piping input to it from the command-line, we can use
    the same functions we'd use to interact with our program to read
    from other commands or files non-interactively.
  #+END_NOTES
  #+BEGIN_SRC bash
session04/src$ gcc -Wall cat.c -o cat
session04/src/$ ./cat
I am typing this
I am typing this
and it prints out
and it prints out
  C-c C-c
  #+END_SRC
  #+BEGIN_SRC bash
session04/src/$ echo "Hello, input" | ./cat
Hello, input
session04/src$ ./cat < cat.c
#include &lt;stdio.h>

int main(void) {
    int c;

    ...
  #+END_SRC
** fopen
  #+BEGIN_NOTES
  - However, the C standard library includes its own method for
    dealing with files
  - fopen is for getting a file handle. It can open files for reading,
    writing, or appending, and can handle them as text or binary, as
    indicated by the letters handed in its second parameter.
  - fopen will return the special value NULL if it is unable to open
    the file.
  p363
  #+END_NOTES
  #+BEGIN_SRC c
  char filename[] = "cat.c";
  FILE *input;
  input = fopen(filename, "r");

  if (input == NULL) {
      printf("Oh no it's broken!\n");
      exit 1;
  }
  #+END_SRC
** getc & putc
  #+BEGIN_NOTES
  - getc and putc work exactly like getchar and putchar respectively,
    but they take additional arguments, which are a FILE pointer.
  - In this way, we can read and write to files directly from within C
    and not rely on piping input around in a Unix environment.
  p365
  #+END_NOTES
  #+BEGIN_SRC c
  FILE *output = fopen(outputFileName, "w");

  while((c=getc(input)) != EOF) {
      putc(c, output);
  }
  #+END_SRC
