session04/lab04.html
<section id="slide-org4f6a0a1">
<h3 id="org4f6a0a1">static</h3>
<aside class="notes">
<ul>
<li>All top-level declarations are visible to external modules by
default. While external modules might need to declare values they
want to use from other modules as external declarations, sometimes
want to invert this behavior, which is what the static declaration does.</li>
<li>Adding static to a declaration makes it so that it is explicitly
invisible to external modules. A static value or function will
only be visible from within its own module.</li>
<li>Even if another module declares an identifier of the same name to
be external, a static declaration will never fulfill that extern
declaration.</li>

</ul>
<p>
p339
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >/* utils.c */
static char[] secret = "my secret string";
static short privateKeyGen(int seed) { /* ... */ }
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >/* main.c */
extern char[] secret; /* never fulfilled */
</code></pre>
</div>
</section>
<section id="slide-org796d0ba">
<h3 id="org796d0ba">static and extern</h3>
<div class="org-src-container">

<pre><code class="c" >/* util.c */
extern double x;
double square(void);
    return x * x;
}
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >/* main.c */
double x;
static double result;
static void doSquare(void) {
    double square(void);
    x = 2.0;
    result = square();
}
int main(void) {
    doSquare();
    printf("%g\n", result);
    return 0;
}
</code></pre>
</div>
</section>
<section id="slide-org5329a64">
<h3 id="org5329a64">Header files</h3>
<aside class="notes">
<p>
p341
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >/* constatnts.h */
struct item {
    int value;
    struct item *next;
};
typedef struct item Item;
typedef struct item List;
#define newList(x) = (List) { .value = x }
#define cons(x, l) = (List) { .value = x, .next = l }
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >/* main.c */
#include "constants.h"

int main(void) {
    List list = newList(4);
    Item i = cons(3, list);
    return 0;
}
</code></pre>
</div>
</section>
<section id="slide-orgf673794">
<h3 id="orgf673794">make</h3>
<aside class="notes">
<p>
p343
</p>

</aside>
<div class="org-src-container">

<pre><code class="makefile" >CC=gcc
CFLAGS=-c -Wall

all: mycp

mycp: main.o utils.o fileio.o
    $(CC) main.o utils.o fileio.o -o mycp

main.o: main.c
    $(CC) $(CFLAGS) main.c

utils.o: utils.c
    $(CC) $(CFLAGS) utils.c

fileio.o: fileio.c
    $(CC) $(CFLAGS) fileio.c

clean:
    rm *o fileio
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org934c1fa">
<h2 id="org934c1fa">I/O</h2>
<aside class="notes">
<ul>
<li>The C standard library provides a bunch of functionality
abstracting around I/O.</li>
<li>We've already been using printf and scanf for a while, but let's
take a deeper look at some of the other functionality it provides.</li>
<li>This is probably the most-used set of abstractions it provides,
which makes sense because without input or output, programs don't
do much.</li>

</ul>

</aside>
<pre  class="example">
fclose  remove  fprintf  escanf    vsprintf rewind   fgetc   gets
fflush  rename  fscanf   vfprintf  vsscanf  clearerr fgets   putc
fopen   tmpfile printf   vfscanf   fgetpos  feof     fputc   putchar
freopen tmpnam  scanf    vprintf   fseek    ferror   fputs   puts
setbuf  fread   snprintf vscanf    fsetpos  perror   getc
setvbuf fwrite  sprintf  vsnprintf ftell    ungetc   getchar
</pre>
</section>
<section id="slide-orgfa3ebe1">
<h3 id="orgfa3ebe1">printf and scanf</h3>
<aside class="notes">
<ul>
<li>So, as I mentioned, we've seen quite a bit of printf and scanf
already, so coming across them this week won't be anything new or
exciting.</li>
<li>However, this week's reading material extensively covers the
patterns involved in printf and scanf in a way that many of you
asked about in earlier sessions.</li>
<li>How the options and patterns work would be worthy of its own full
class session worth of discussion, but the book covers this in
enough detail to be a great reference.</li>

</ul>
<p>
p348
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >printf("20.5%s", "Jessica");  /* "                Jessi" */
printf("-20.5%s", "Jessica"); /* "Jessi                " */

scanf("%[^\n]\n", &buffer);
</code></pre>
</div>
</section>
<section id="slide-orgf912a6f">
<h3 id="orgf912a6f">getchar and putchar</h3>
<aside class="notes">
<ul>
<li>getchar and putchar are the bread and butter of I/O.</li>
<li>They are responsible for getting one character from input and
sending one character to output, respectively</li>

</ul>
<p>
p348
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >int c = getchar();
putchar('\n');
</code></pre>
</div>
</section>
<section id="slide-orgb2dfb7c">
<h3 id="orgb2dfb7c">STDIN on Unix</h3>
<aside class="notes">
<ul>
<li>Now, if you're familiar with Unix, you're probably familiar with
the ability to change the input stream to a program.</li>
<li>Harnessing this ability to change where input comes from gives us
an easy way to start working with files.</li>
<li>Here, we have a program to emulate basic behavior of the Unix cat
tool</li>
<li>Note that the special constant EOF is used to denote an end of
file marker character</li>

</ul>
<p>
p359
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >/* cat.c */
#include &lt;stdio.h>

int main(void) {
    int c;

    while ((c=getchar()) != EOF) {
        putchar(c);
    }
    return 0;
}
</code></pre>
</div>
</section>
<section id="slide-orgc22b951">
<h3 id="orgc22b951">STDIN on Unix</h3>
<aside class="notes">
<ul>
<li>Running this program will capture and print each character, as
expected. It will read from the standard input or stdin, so if we
run this without piping input to it, it will expect us to enter
that input directly from the keyboard.</li>
<li>However, by piping input to it from the command-line, we can use
the same functions we'd use to interact with our program to read
from other commands or files non-interactively.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="bash" >session04/src$ gcc -Wall cat.c -o cat
session04/src/$ ./cat
I am typing this
I am typing this
and it prints out
and it prints out
  C-c C-c
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="bash" >session04/src/$ echo "Hello, input" | ./cat
Hello, input
session04/src$ ./cat < cat.c
#include &lt;stdio.h>

int main(void) {
    int c;

    ...
</code></pre>
</div>
</section>
<section id="slide-org9294511">
<h3 id="org9294511">fopen</h3>
<aside class="notes">
<ul>
<li>However, the C standard library includes its own method for
dealing with files</li>
<li>fopen is for getting a file handle. It can open files for reading,
writing, or appending, and can handle them as text or binary, as
indicated by the letters handed in its second parameter.</li>
<li>fopen will return the special value NULL if it is unable to open
the file.</li>

</ul>
<p>
p363
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >char filename[] = "cat.c";
FILE *input;
input = fopen(filename, "r");

if (input == NULL) {
    printf("Oh no it's broken!\n");
    exit 1;
}
</code></pre>
</div>
</section>
<section id="slide-org1a17943">
<h3 id="org1a17943">getc &amp; putc</h3>
<aside class="notes">
<ul>
<li>getc and putc work exactly like getchar and putchar respectively,
but they take additional arguments, which are a FILE pointer.</li>
<li>In this way, we can read and write to files directly from within C
and not rely on piping input around in a Unix environment.</li>

</ul>
<p>
p365
</p>

</aside>
<div class="org-src-container">

<pre><code class="c" >FILE *output = fopen(outputFileName, "w");

while((c=getc(input)) != EOF) {
    putc(c, output);
}
</code></pre>
</div>
</section>
